# 3. Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.

first = input("Введите строку: ")
second = input("Введите строку: ")
print(first.count(second))