# 2. Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

# in
# 54

# out
# [2, 3, 3, 3]

# in
# 9990

# out
# [2, 3, 3, 3, 5, 37]

# in
# 650

# out
# [2, 5, 5, 13]

import math

n = int(input("Введите число для разложения: "))
q = 2
pr = []
if n % q == 0:
    pr.append(2)
q += 1
while q <= n:
    if n % q == 0:
        pr.append(q)
        n = n/q
        q = 1
    q += 2

print(pr)
